astb_relise/src/Catalogs/ВидыСИЗ/ВидыСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСИЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дерматологический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыдачиСИЗ</name>
    <type>
      <types>EnumRef.СпособыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВидаСИЗ</name>
    <type>
      <types>EnumRef.КатагорииВидовСИЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/Catalogs/ВидыСИЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ВидВыдачиСИЗ");
	РедактируемыеРеквизиты.Добавить("СпособВыдачиСИЗ");
	РедактируемыеРеквизиты.Добавить("ИспользоватьШтрихкод");
	РедактируемыеРеквизиты.Добавить("Дерматологический");
	РедактируемыеРеквизиты.Добавить("КатегорияВидаСИЗ");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

// Возвращает описание блокируемых реквизитов
// Возвращаемое значение: массив
// Элемент массива: строка в формате
//		ИмяРеквизита[;ИмяЭлементаФормы,...]
// где	ИмяРеквизита - имя реквизита объекта
//		ИмяЭлементаФормы - имя элемента формы, связанного с реквизитом
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
		
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

#КонецЕсли
